MikroElektronika/core_packages/PIC/XC8/def/PIC18LF65K40/mcu.h
// Register: RX3PPS
#define RX3PPS RX3PPS
extern volatile unsigned char           RX3PPS              __at(0xE13);
#ifndef _LIB_BUILD
asm("RX3PPS equ 0E13h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PIN                    :3;
        unsigned PORT                   :3;
    };
    struct {
        unsigned RX3PPS                 :6;
    };
    struct {
        unsigned RX3PPS0                :1;
        unsigned RX3PPS1                :1;
        unsigned RX3PPS2                :1;
        unsigned RX3PPS3                :1;
        unsigned RX3PPS4                :1;
        unsigned RX3PPS5                :1;
    };
} RX3PPSbits_t;
extern volatile RX3PPSbits_t RX3PPSbits __at(0xE13);
// bitfield macros
#define _RX3PPS_PIN_POSN                                    0x0
#define _RX3PPS_PIN_POSITION                                0x0
#define _RX3PPS_PIN_SIZE                                    0x3
#define _RX3PPS_PIN_LENGTH                                  0x3
#define _RX3PPS_PIN_MASK                                    0x7
#define _RX3PPS_PORT_POSN                                   0x3
#define _RX3PPS_PORT_POSITION                               0x3
#define _RX3PPS_PORT_SIZE                                   0x3
#define _RX3PPS_PORT_LENGTH                                 0x3
#define _RX3PPS_PORT_MASK                                   0x38
#define _RX3PPS_RX3PPS_POSN                                 0x0
#define _RX3PPS_RX3PPS_POSITION                             0x0
#define _RX3PPS_RX3PPS_SIZE                                 0x6
#define _RX3PPS_RX3PPS_LENGTH                               0x6
#define _RX3PPS_RX3PPS_MASK                                 0x3F
#define _RX3PPS_RX3PPS0_POSN                                0x0
#define _RX3PPS_RX3PPS0_POSITION                            0x0
#define _RX3PPS_RX3PPS0_SIZE                                0x1
#define _RX3PPS_RX3PPS0_LENGTH                              0x1
#define _RX3PPS_RX3PPS0_MASK                                0x1
#define _RX3PPS_RX3PPS1_POSN                                0x1
#define _RX3PPS_RX3PPS1_POSITION                            0x1
#define _RX3PPS_RX3PPS1_SIZE                                0x1
#define _RX3PPS_RX3PPS1_LENGTH                              0x1
#define _RX3PPS_RX3PPS1_MASK                                0x2
#define _RX3PPS_RX3PPS2_POSN                                0x2
#define _RX3PPS_RX3PPS2_POSITION                            0x2
#define _RX3PPS_RX3PPS2_SIZE                                0x1
#define _RX3PPS_RX3PPS2_LENGTH                              0x1
#define _RX3PPS_RX3PPS2_MASK                                0x4
#define _RX3PPS_RX3PPS3_POSN                                0x3
#define _RX3PPS_RX3PPS3_POSITION                            0x3
#define _RX3PPS_RX3PPS3_SIZE                                0x1
#define _RX3PPS_RX3PPS3_LENGTH                              0x1
#define _RX3PPS_RX3PPS3_MASK                                0x8
#define _RX3PPS_RX3PPS4_POSN                                0x4
#define _RX3PPS_RX3PPS4_POSITION                            0x4
#define _RX3PPS_RX3PPS4_SIZE                                0x1
#define _RX3PPS_RX3PPS4_LENGTH                              0x1
#define _RX3PPS_RX3PPS4_MASK                                0x10
#define _RX3PPS_RX3PPS5_POSN                                0x5
#define _RX3PPS_RX3PPS5_POSITION                            0x5
#define _RX3PPS_RX3PPS5_SIZE                                0x1
#define _RX3PPS_RX3PPS5_LENGTH                              0x1
#define _RX3PPS_RX3PPS5_MASK                                0x20

// Register: CK3PPS
#define CK3PPS CK3PPS
extern volatile unsigned char           CK3PPS              __at(0xE14);
#ifndef _LIB_BUILD
asm("CK3PPS equ 0E14h");
#endif
// aliases
extern volatile unsigned char           TX3PPS              __at(0xE14);
#ifndef _LIB_BUILD
asm("TX3PPS equ 0E14h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PIN                    :3;
        unsigned PORT                   :3;
    };
    struct {
        unsigned TX3PPS                 :6;
    };
    struct {
        unsigned TX3PPS0                :1;
        unsigned TX3PPS1                :1;
        unsigned TX3PPS2                :1;
        unsigned TX3PPS3                :1;
        unsigned TX3PPS4                :1;
        unsigned TX3PPS5                :1;
    };
} CK3PPSbits_t;
extern volatile CK3PPSbits_t CK3PPSbits __at(0xE14);
// bitfield macros
#define _CK3PPS_PIN_POSN                                    0x0
#define _CK3PPS_PIN_POSITION                                0x0
#define _CK3PPS_PIN_SIZE                                    0x3
#define _CK3PPS_PIN_LENGTH                                  0x3
#define _CK3PPS_PIN_MASK                                    0x7
#define _CK3PPS_PORT_POSN                                   0x3
#define _CK3PPS_PORT_POSITION                               0x3
#define _CK3PPS_PORT_SIZE                                   0x3
#define _CK3PPS_PORT_LENGTH                                 0x3
#define _CK3PPS_PORT_MASK                                   0x38
#define _CK3PPS_TX3PPS_POSN                                 0x0
#define _CK3PPS_TX3PPS_POSITION                             0x0
#define _CK3PPS_TX3PPS_SIZE                                 0x6
#define _CK3PPS_TX3PPS_LENGTH                               0x6
#define _CK3PPS_TX3PPS_MASK                                 0x3F
#define _CK3PPS_TX3PPS0_POSN                                0x0
#define _CK3PPS_TX3PPS0_POSITION                            0x0
#define _CK3PPS_TX3PPS0_SIZE                                0x1
#define _CK3PPS_TX3PPS0_LENGTH                              0x1
#define _CK3PPS_TX3PPS0_MASK                                0x1
#define _CK3PPS_TX3PPS1_POSN                                0x1
#define _CK3PPS_TX3PPS1_POSITION                            0x1
#define _CK3PPS_TX3PPS1_SIZE                                0x1
#define _CK3PPS_TX3PPS1_LENGTH                              0x1
#define _CK3PPS_TX3PPS1_MASK                                0x2
#define _CK3PPS_TX3PPS2_POSN                                0x2
#define _CK3PPS_TX3PPS2_POSITION                            0x2
#define _CK3PPS_TX3PPS2_SIZE                                0x1
#define _CK3PPS_TX3PPS2_LENGTH                              0x1
#define _CK3PPS_TX3PPS2_MASK                                0x4
#define _CK3PPS_TX3PPS3_POSN                                0x3
#define _CK3PPS_TX3PPS3_POSITION                            0x3
#define _CK3PPS_TX3PPS3_SIZE                                0x1
#define _CK3PPS_TX3PPS3_LENGTH                              0x1
#define _CK3PPS_TX3PPS3_MASK                                0x8
#define _CK3PPS_TX3PPS4_POSN                                0x4
#define _CK3PPS_TX3PPS4_POSITION                            0x4
#define _CK3PPS_TX3PPS4_SIZE                                0x1
#define _CK3PPS_TX3PPS4_LENGTH                              0x1
#define _CK3PPS_TX3PPS4_MASK                                0x10
#define _CK3PPS_TX3PPS5_POSN                                0x5
#define _CK3PPS_TX3PPS5_POSITION                            0x5
#define _CK3PPS_TX3PPS5_SIZE                                0x1
#define _CK3PPS_TX3PPS5_LENGTH                              0x1
#define _CK3PPS_TX3PPS5_MASK                                0x20
// alias bitfield definitions
typedef union {
    struct {
        unsigned PIN                    :3;
        unsigned PORT                   :3;
    };
    struct {
        unsigned TX3PPS                 :6;
    };
    struct {
        unsigned TX3PPS0                :1;
        unsigned TX3PPS1                :1;
        unsigned TX3PPS2                :1;
        unsigned TX3PPS3                :1;
        unsigned TX3PPS4                :1;
        unsigned TX3PPS5                :1;
    };
} TX3PPSbits_t;
