MikroElektronika/core_packages/PIC/XC8/def/PIC18LF65K40/mcu.h
// Register: RE3PPS
#define RE3PPS RE3PPS
extern volatile unsigned char           RE3PPS              __at(0xE75);
#ifndef _LIB_BUILD
asm("RE3PPS equ 0E75h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RE3PPS0                :1;
        unsigned RE3PPS1                :1;
        unsigned RE3PPS2                :1;
        unsigned RE3PPS3                :1;
        unsigned RE3PPS4                :1;
        unsigned RE3PPS5                :1;
    };
} RE3PPSbits_t;
extern volatile RE3PPSbits_t RE3PPSbits __at(0xE75);
// bitfield macros
#define _RE3PPS_RE3PPS0_POSN                                0x0
#define _RE3PPS_RE3PPS0_POSITION                            0x0
#define _RE3PPS_RE3PPS0_SIZE                                0x1
#define _RE3PPS_RE3PPS0_LENGTH                              0x1
#define _RE3PPS_RE3PPS0_MASK                                0x1
#define _RE3PPS_RE3PPS1_POSN                                0x1
#define _RE3PPS_RE3PPS1_POSITION                            0x1
#define _RE3PPS_RE3PPS1_SIZE                                0x1
#define _RE3PPS_RE3PPS1_LENGTH                              0x1
#define _RE3PPS_RE3PPS1_MASK                                0x2
#define _RE3PPS_RE3PPS2_POSN                                0x2
#define _RE3PPS_RE3PPS2_POSITION                            0x2
#define _RE3PPS_RE3PPS2_SIZE                                0x1
#define _RE3PPS_RE3PPS2_LENGTH                              0x1
#define _RE3PPS_RE3PPS2_MASK                                0x4
#define _RE3PPS_RE3PPS3_POSN                                0x3
#define _RE3PPS_RE3PPS3_POSITION                            0x3
#define _RE3PPS_RE3PPS3_SIZE                                0x1
#define _RE3PPS_RE3PPS3_LENGTH                              0x1
#define _RE3PPS_RE3PPS3_MASK                                0x8
#define _RE3PPS_RE3PPS4_POSN                                0x4
#define _RE3PPS_RE3PPS4_POSITION                            0x4
#define _RE3PPS_RE3PPS4_SIZE                                0x1
#define _RE3PPS_RE3PPS4_LENGTH                              0x1
#define _RE3PPS_RE3PPS4_MASK                                0x10
#define _RE3PPS_RE3PPS5_POSN                                0x5
#define _RE3PPS_RE3PPS5_POSITION                            0x5
#define _RE3PPS_RE3PPS5_SIZE                                0x1
#define _RE3PPS_RE3PPS5_LENGTH                              0x1
#define _RE3PPS_RE3PPS5_MASK                                0x20

// Register: RE4PPS
#define RE4PPS RE4PPS
extern volatile unsigned char           RE4PPS              __at(0xE76);
#ifndef _LIB_BUILD
asm("RE4PPS equ 0E76h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RE4PPS0                :1;
        unsigned RE4PPS1                :1;
        unsigned RE4PPS2                :1;
        unsigned RE4PPS3                :1;
        unsigned RE4PPS4                :1;
        unsigned RE4PPS5                :1;
    };
} RE4PPSbits_t;
extern volatile RE4PPSbits_t RE4PPSbits __at(0xE76);
// bitfield macros
#define _RE4PPS_RE4PPS0_POSN                                0x0
#define _RE4PPS_RE4PPS0_POSITION                            0x0
#define _RE4PPS_RE4PPS0_SIZE                                0x1
#define _RE4PPS_RE4PPS0_LENGTH                              0x1
#define _RE4PPS_RE4PPS0_MASK                                0x1
#define _RE4PPS_RE4PPS1_POSN                                0x1
#define _RE4PPS_RE4PPS1_POSITION                            0x1
#define _RE4PPS_RE4PPS1_SIZE                                0x1
#define _RE4PPS_RE4PPS1_LENGTH                              0x1
#define _RE4PPS_RE4PPS1_MASK                                0x2
#define _RE4PPS_RE4PPS2_POSN                                0x2
#define _RE4PPS_RE4PPS2_POSITION                            0x2
#define _RE4PPS_RE4PPS2_SIZE                                0x1
#define _RE4PPS_RE4PPS2_LENGTH                              0x1
#define _RE4PPS_RE4PPS2_MASK                                0x4
#define _RE4PPS_RE4PPS3_POSN                                0x3
#define _RE4PPS_RE4PPS3_POSITION                            0x3
#define _RE4PPS_RE4PPS3_SIZE                                0x1
#define _RE4PPS_RE4PPS3_LENGTH                              0x1
#define _RE4PPS_RE4PPS3_MASK                                0x8
#define _RE4PPS_RE4PPS4_POSN                                0x4
#define _RE4PPS_RE4PPS4_POSITION                            0x4
#define _RE4PPS_RE4PPS4_SIZE                                0x1
#define _RE4PPS_RE4PPS4_LENGTH                              0x1
#define _RE4PPS_RE4PPS4_MASK                                0x10
#define _RE4PPS_RE4PPS5_POSN                                0x5
#define _RE4PPS_RE4PPS5_POSITION                            0x5
#define _RE4PPS_RE4PPS5_SIZE                                0x1
#define _RE4PPS_RE4PPS5_LENGTH                              0x1
#define _RE4PPS_RE4PPS5_MASK                                0x20

// Register: RE5PPS
#define RE5PPS RE5PPS
extern volatile unsigned char           RE5PPS              __at(0xE77);
#ifndef _LIB_BUILD
asm("RE5PPS equ 0E77h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RE5PPS0                :1;
        unsigned RE5PPS1                :1;
        unsigned RE5PPS2                :1;
        unsigned RE5PPS3                :1;
        unsigned RE5PPS4                :1;
        unsigned RE5PPS5                :1;
    };
} RE5PPSbits_t;
extern volatile RE5PPSbits_t RE5PPSbits __at(0xE77);
// bitfield macros
#define _RE5PPS_RE5PPS0_POSN                                0x0
#define _RE5PPS_RE5PPS0_POSITION                            0x0
#define _RE5PPS_RE5PPS0_SIZE                                0x1
#define _RE5PPS_RE5PPS0_LENGTH                              0x1
#define _RE5PPS_RE5PPS0_MASK                                0x1
#define _RE5PPS_RE5PPS1_POSN                                0x1
#define _RE5PPS_RE5PPS1_POSITION                            0x1
#define _RE5PPS_RE5PPS1_SIZE                                0x1
#define _RE5PPS_RE5PPS1_LENGTH                              0x1
#define _RE5PPS_RE5PPS1_MASK                                0x2
#define _RE5PPS_RE5PPS2_POSN                                0x2
#define _RE5PPS_RE5PPS2_POSITION                            0x2
#define _RE5PPS_RE5PPS2_SIZE                                0x1
#define _RE5PPS_RE5PPS2_LENGTH                              0x1
#define _RE5PPS_RE5PPS2_MASK                                0x4
#define _RE5PPS_RE5PPS3_POSN                                0x3
#define _RE5PPS_RE5PPS3_POSITION                            0x3
#define _RE5PPS_RE5PPS3_SIZE                                0x1
#define _RE5PPS_RE5PPS3_LENGTH                              0x1
#define _RE5PPS_RE5PPS3_MASK                                0x8
#define _RE5PPS_RE5PPS4_POSN                                0x4
#define _RE5PPS_RE5PPS4_POSITION                            0x4
#define _RE5PPS_RE5PPS4_SIZE                                0x1
#define _RE5PPS_RE5PPS4_LENGTH                              0x1
#define _RE5PPS_RE5PPS4_MASK                                0x10
#define _RE5PPS_RE5PPS5_POSN                                0x5
#define _RE5PPS_RE5PPS5_POSITION                            0x5
#define _RE5PPS_RE5PPS5_SIZE                                0x1
#define _RE5PPS_RE5PPS5_LENGTH                              0x1
#define _RE5PPS_RE5PPS5_MASK                                0x20

// Register: RE6PPS
#define RE6PPS RE6PPS
extern volatile unsigned char           RE6PPS              __at(0xE78);
#ifndef _LIB_BUILD
asm("RE6PPS equ 0E78h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RE6PPS0                :1;
        unsigned RE6PPS1                :1;
        unsigned RE6PPS2                :1;
        unsigned RE6PPS3                :1;
        unsigned RE6PPS4                :1;
        unsigned RE6PPS5                :1;
    };
} RE6PPSbits_t;
