MikroElektronika/core_packages/PIC/XC8/def/PIC18LF65K40/mcu.h
// Register: RF3PPS
#define RF3PPS RF3PPS
extern volatile unsigned char           RF3PPS              __at(0xE7D);
#ifndef _LIB_BUILD
asm("RF3PPS equ 0E7Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RF3PPS0                :1;
        unsigned RF3PPS1                :1;
        unsigned RF3PPS2                :1;
        unsigned RF3PPS3                :1;
        unsigned RF3PPS4                :1;
        unsigned RF3PPS5                :1;
    };
} RF3PPSbits_t;
extern volatile RF3PPSbits_t RF3PPSbits __at(0xE7D);
// bitfield macros
#define _RF3PPS_RF3PPS0_POSN                                0x0
#define _RF3PPS_RF3PPS0_POSITION                            0x0
#define _RF3PPS_RF3PPS0_SIZE                                0x1
#define _RF3PPS_RF3PPS0_LENGTH                              0x1
#define _RF3PPS_RF3PPS0_MASK                                0x1
#define _RF3PPS_RF3PPS1_POSN                                0x1
#define _RF3PPS_RF3PPS1_POSITION                            0x1
#define _RF3PPS_RF3PPS1_SIZE                                0x1
#define _RF3PPS_RF3PPS1_LENGTH                              0x1
#define _RF3PPS_RF3PPS1_MASK                                0x2
#define _RF3PPS_RF3PPS2_POSN                                0x2
#define _RF3PPS_RF3PPS2_POSITION                            0x2
#define _RF3PPS_RF3PPS2_SIZE                                0x1
#define _RF3PPS_RF3PPS2_LENGTH                              0x1
#define _RF3PPS_RF3PPS2_MASK                                0x4
#define _RF3PPS_RF3PPS3_POSN                                0x3
#define _RF3PPS_RF3PPS3_POSITION                            0x3
#define _RF3PPS_RF3PPS3_SIZE                                0x1
#define _RF3PPS_RF3PPS3_LENGTH                              0x1
#define _RF3PPS_RF3PPS3_MASK                                0x8
#define _RF3PPS_RF3PPS4_POSN                                0x4
#define _RF3PPS_RF3PPS4_POSITION                            0x4
#define _RF3PPS_RF3PPS4_SIZE                                0x1
#define _RF3PPS_RF3PPS4_LENGTH                              0x1
#define _RF3PPS_RF3PPS4_MASK                                0x10
#define _RF3PPS_RF3PPS5_POSN                                0x5
#define _RF3PPS_RF3PPS5_POSITION                            0x5
#define _RF3PPS_RF3PPS5_SIZE                                0x1
#define _RF3PPS_RF3PPS5_LENGTH                              0x1
#define _RF3PPS_RF3PPS5_MASK                                0x20

// Register: RF4PPS
#define RF4PPS RF4PPS
extern volatile unsigned char           RF4PPS              __at(0xE7E);
#ifndef _LIB_BUILD
asm("RF4PPS equ 0E7Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RF4PPS0                :1;
        unsigned RF4PPS1                :1;
        unsigned RF4PPS2                :1;
        unsigned RF4PPS3                :1;
        unsigned RF4PPS4                :1;
        unsigned RF4PPS5                :1;
    };
} RF4PPSbits_t;
extern volatile RF4PPSbits_t RF4PPSbits __at(0xE7E);
// bitfield macros
#define _RF4PPS_RF4PPS0_POSN                                0x0
#define _RF4PPS_RF4PPS0_POSITION                            0x0
#define _RF4PPS_RF4PPS0_SIZE                                0x1
#define _RF4PPS_RF4PPS0_LENGTH                              0x1
#define _RF4PPS_RF4PPS0_MASK                                0x1
#define _RF4PPS_RF4PPS1_POSN                                0x1
#define _RF4PPS_RF4PPS1_POSITION                            0x1
#define _RF4PPS_RF4PPS1_SIZE                                0x1
#define _RF4PPS_RF4PPS1_LENGTH                              0x1
#define _RF4PPS_RF4PPS1_MASK                                0x2
#define _RF4PPS_RF4PPS2_POSN                                0x2
#define _RF4PPS_RF4PPS2_POSITION                            0x2
#define _RF4PPS_RF4PPS2_SIZE                                0x1
#define _RF4PPS_RF4PPS2_LENGTH                              0x1
#define _RF4PPS_RF4PPS2_MASK                                0x4
#define _RF4PPS_RF4PPS3_POSN                                0x3
#define _RF4PPS_RF4PPS3_POSITION                            0x3
#define _RF4PPS_RF4PPS3_SIZE                                0x1
#define _RF4PPS_RF4PPS3_LENGTH                              0x1
#define _RF4PPS_RF4PPS3_MASK                                0x8
#define _RF4PPS_RF4PPS4_POSN                                0x4
#define _RF4PPS_RF4PPS4_POSITION                            0x4
#define _RF4PPS_RF4PPS4_SIZE                                0x1
#define _RF4PPS_RF4PPS4_LENGTH                              0x1
#define _RF4PPS_RF4PPS4_MASK                                0x10
#define _RF4PPS_RF4PPS5_POSN                                0x5
#define _RF4PPS_RF4PPS5_POSITION                            0x5
#define _RF4PPS_RF4PPS5_SIZE                                0x1
#define _RF4PPS_RF4PPS5_LENGTH                              0x1
#define _RF4PPS_RF4PPS5_MASK                                0x20

// Register: RF5PPS
#define RF5PPS RF5PPS
extern volatile unsigned char           RF5PPS              __at(0xE7F);
#ifndef _LIB_BUILD
asm("RF5PPS equ 0E7Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RF5PPS0                :1;
        unsigned RF5PPS1                :1;
        unsigned RF5PPS2                :1;
        unsigned RF5PPS3                :1;
        unsigned RF5PPS4                :1;
        unsigned RF5PPS5                :1;
    };
} RF5PPSbits_t;
extern volatile RF5PPSbits_t RF5PPSbits __at(0xE7F);
// bitfield macros
#define _RF5PPS_RF5PPS0_POSN                                0x0
#define _RF5PPS_RF5PPS0_POSITION                            0x0
#define _RF5PPS_RF5PPS0_SIZE                                0x1
#define _RF5PPS_RF5PPS0_LENGTH                              0x1
#define _RF5PPS_RF5PPS0_MASK                                0x1
#define _RF5PPS_RF5PPS1_POSN                                0x1
#define _RF5PPS_RF5PPS1_POSITION                            0x1
#define _RF5PPS_RF5PPS1_SIZE                                0x1
#define _RF5PPS_RF5PPS1_LENGTH                              0x1
#define _RF5PPS_RF5PPS1_MASK                                0x2
#define _RF5PPS_RF5PPS2_POSN                                0x2
#define _RF5PPS_RF5PPS2_POSITION                            0x2
#define _RF5PPS_RF5PPS2_SIZE                                0x1
#define _RF5PPS_RF5PPS2_LENGTH                              0x1
#define _RF5PPS_RF5PPS2_MASK                                0x4
#define _RF5PPS_RF5PPS3_POSN                                0x3
#define _RF5PPS_RF5PPS3_POSITION                            0x3
#define _RF5PPS_RF5PPS3_SIZE                                0x1
#define _RF5PPS_RF5PPS3_LENGTH                              0x1
#define _RF5PPS_RF5PPS3_MASK                                0x8
#define _RF5PPS_RF5PPS4_POSN                                0x4
#define _RF5PPS_RF5PPS4_POSITION                            0x4
#define _RF5PPS_RF5PPS4_SIZE                                0x1
#define _RF5PPS_RF5PPS4_LENGTH                              0x1
#define _RF5PPS_RF5PPS4_MASK                                0x10
#define _RF5PPS_RF5PPS5_POSN                                0x5
#define _RF5PPS_RF5PPS5_POSITION                            0x5
#define _RF5PPS_RF5PPS5_SIZE                                0x1
#define _RF5PPS_RF5PPS5_LENGTH                              0x1
#define _RF5PPS_RF5PPS5_MASK                                0x20

// Register: RF6PPS
#define RF6PPS RF6PPS
extern volatile unsigned char           RF6PPS              __at(0xE80);
#ifndef _LIB_BUILD
asm("RF6PPS equ 0E80h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RF6PPS0                :1;
        unsigned RF6PPS1                :1;
        unsigned RF6PPS2                :1;
        unsigned RF6PPS3                :1;
        unsigned RF6PPS4                :1;
        unsigned RF6PPS5                :1;
    };
} RF6PPSbits_t;
extern volatile RF6PPSbits_t RF6PPSbits __at(0xE80);
// bitfield macros
#define _RF6PPS_RF6PPS0_POSN                                0x0
#define _RF6PPS_RF6PPS0_POSITION                            0x0
#define _RF6PPS_RF6PPS0_SIZE                                0x1
#define _RF6PPS_RF6PPS0_LENGTH                              0x1
#define _RF6PPS_RF6PPS0_MASK                                0x1
#define _RF6PPS_RF6PPS1_POSN                                0x1
#define _RF6PPS_RF6PPS1_POSITION                            0x1
#define _RF6PPS_RF6PPS1_SIZE                                0x1
#define _RF6PPS_RF6PPS1_LENGTH                              0x1
#define _RF6PPS_RF6PPS1_MASK                                0x2
#define _RF6PPS_RF6PPS2_POSN                                0x2
#define _RF6PPS_RF6PPS2_POSITION                            0x2
#define _RF6PPS_RF6PPS2_SIZE                                0x1
#define _RF6PPS_RF6PPS2_LENGTH                              0x1
#define _RF6PPS_RF6PPS2_MASK                                0x4
#define _RF6PPS_RF6PPS3_POSN                                0x3
#define _RF6PPS_RF6PPS3_POSITION                            0x3
#define _RF6PPS_RF6PPS3_SIZE                                0x1
#define _RF6PPS_RF6PPS3_LENGTH                              0x1
#define _RF6PPS_RF6PPS3_MASK                                0x8
#define _RF6PPS_RF6PPS4_POSN                                0x4
#define _RF6PPS_RF6PPS4_POSITION                            0x4
#define _RF6PPS_RF6PPS4_SIZE                                0x1
#define _RF6PPS_RF6PPS4_LENGTH                              0x1
#define _RF6PPS_RF6PPS4_MASK                                0x10
#define _RF6PPS_RF6PPS5_POSN                                0x5
#define _RF6PPS_RF6PPS5_POSITION                            0x5
#define _RF6PPS_RF6PPS5_SIZE                                0x1
#define _RF6PPS_RF6PPS5_LENGTH                              0x1
#define _RF6PPS_RF6PPS5_MASK                                0x20

// Register: RF7PPS
#define RF7PPS RF7PPS
extern volatile unsigned char           RF7PPS              __at(0xE81);
#ifndef _LIB_BUILD
asm("RF7PPS equ 0E81h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RF7PPS0                :1;
        unsigned RF7PPS1                :1;
        unsigned RF7PPS2                :1;
        unsigned RF7PPS3                :1;
        unsigned RF7PPS4                :1;
        unsigned RF7PPS5                :1;
    };
} RF7PPSbits_t;
