MikroElektronika/core_packages/PIC/XC8/def/PIC18LF65K40/mcu.h
// Register: SLRCOND
#define SLRCOND SLRCOND
extern volatile unsigned char           SLRCOND             __at(0xEA4);
#ifndef _LIB_BUILD
asm("SLRCOND equ 0EA4h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SLRD0                  :1;
        unsigned SLRD1                  :1;
        unsigned SLRD2                  :1;
        unsigned SLRD3                  :1;
        unsigned SLRD4                  :1;
        unsigned SLRD5                  :1;
        unsigned SLRD6                  :1;
        unsigned SLRD7                  :1;
    };
} SLRCONDbits_t;
extern volatile SLRCONDbits_t SLRCONDbits __at(0xEA4);
// bitfield macros
#define _SLRCOND_SLRD0_POSN                                 0x0
#define _SLRCOND_SLRD0_POSITION                             0x0
#define _SLRCOND_SLRD0_SIZE                                 0x1
#define _SLRCOND_SLRD0_LENGTH                               0x1
#define _SLRCOND_SLRD0_MASK                                 0x1
#define _SLRCOND_SLRD1_POSN                                 0x1
#define _SLRCOND_SLRD1_POSITION                             0x1
#define _SLRCOND_SLRD1_SIZE                                 0x1
#define _SLRCOND_SLRD1_LENGTH                               0x1
#define _SLRCOND_SLRD1_MASK                                 0x2
#define _SLRCOND_SLRD2_POSN                                 0x2
#define _SLRCOND_SLRD2_POSITION                             0x2
#define _SLRCOND_SLRD2_SIZE                                 0x1
#define _SLRCOND_SLRD2_LENGTH                               0x1
#define _SLRCOND_SLRD2_MASK                                 0x4
#define _SLRCOND_SLRD3_POSN                                 0x3
#define _SLRCOND_SLRD3_POSITION                             0x3
#define _SLRCOND_SLRD3_SIZE                                 0x1
#define _SLRCOND_SLRD3_LENGTH                               0x1
#define _SLRCOND_SLRD3_MASK                                 0x8
#define _SLRCOND_SLRD4_POSN                                 0x4
#define _SLRCOND_SLRD4_POSITION                             0x4
#define _SLRCOND_SLRD4_SIZE                                 0x1
#define _SLRCOND_SLRD4_LENGTH                               0x1
#define _SLRCOND_SLRD4_MASK                                 0x10
#define _SLRCOND_SLRD5_POSN                                 0x5
#define _SLRCOND_SLRD5_POSITION                             0x5
#define _SLRCOND_SLRD5_SIZE                                 0x1
#define _SLRCOND_SLRD5_LENGTH                               0x1
#define _SLRCOND_SLRD5_MASK                                 0x20
#define _SLRCOND_SLRD6_POSN                                 0x6
#define _SLRCOND_SLRD6_POSITION                             0x6
#define _SLRCOND_SLRD6_SIZE                                 0x1
#define _SLRCOND_SLRD6_LENGTH                               0x1
#define _SLRCOND_SLRD6_MASK                                 0x40
#define _SLRCOND_SLRD7_POSN                                 0x7
#define _SLRCOND_SLRD7_POSITION                             0x7
#define _SLRCOND_SLRD7_SIZE                                 0x1
#define _SLRCOND_SLRD7_LENGTH                               0x1
#define _SLRCOND_SLRD7_MASK                                 0x80

// Register: ODCOND
#define ODCOND ODCOND
extern volatile unsigned char           ODCOND              __at(0xEA5);
#ifndef _LIB_BUILD
asm("ODCOND equ 0EA5h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ODCD0                  :1;
        unsigned ODCD1                  :1;
        unsigned ODCD2                  :1;
        unsigned ODCD3                  :1;
        unsigned ODCD4                  :1;
        unsigned ODCD5                  :1;
        unsigned ODCD6                  :1;
        unsigned ODCD7                  :1;
    };
} ODCONDbits_t;
extern volatile ODCONDbits_t ODCONDbits __at(0xEA5);
// bitfield macros
#define _ODCOND_ODCD0_POSN                                  0x0
#define _ODCOND_ODCD0_POSITION                              0x0
#define _ODCOND_ODCD0_SIZE                                  0x1
#define _ODCOND_ODCD0_LENGTH                                0x1
#define _ODCOND_ODCD0_MASK                                  0x1
#define _ODCOND_ODCD1_POSN                                  0x1
#define _ODCOND_ODCD1_POSITION                              0x1
#define _ODCOND_ODCD1_SIZE                                  0x1
#define _ODCOND_ODCD1_LENGTH                                0x1
#define _ODCOND_ODCD1_MASK                                  0x2
#define _ODCOND_ODCD2_POSN                                  0x2
#define _ODCOND_ODCD2_POSITION                              0x2
#define _ODCOND_ODCD2_SIZE                                  0x1
#define _ODCOND_ODCD2_LENGTH                                0x1
#define _ODCOND_ODCD2_MASK                                  0x4
#define _ODCOND_ODCD3_POSN                                  0x3
#define _ODCOND_ODCD3_POSITION                              0x3
#define _ODCOND_ODCD3_SIZE                                  0x1
#define _ODCOND_ODCD3_LENGTH                                0x1
#define _ODCOND_ODCD3_MASK                                  0x8
#define _ODCOND_ODCD4_POSN                                  0x4
#define _ODCOND_ODCD4_POSITION                              0x4
#define _ODCOND_ODCD4_SIZE                                  0x1
#define _ODCOND_ODCD4_LENGTH                                0x1
#define _ODCOND_ODCD4_MASK                                  0x10
#define _ODCOND_ODCD5_POSN                                  0x5
#define _ODCOND_ODCD5_POSITION                              0x5
#define _ODCOND_ODCD5_SIZE                                  0x1
#define _ODCOND_ODCD5_LENGTH                                0x1
#define _ODCOND_ODCD5_MASK                                  0x20
#define _ODCOND_ODCD6_POSN                                  0x6
#define _ODCOND_ODCD6_POSITION                              0x6
#define _ODCOND_ODCD6_SIZE                                  0x1
#define _ODCOND_ODCD6_LENGTH                                0x1
#define _ODCOND_ODCD6_MASK                                  0x40
#define _ODCOND_ODCD7_POSN                                  0x7
#define _ODCOND_ODCD7_POSITION                              0x7
#define _ODCOND_ODCD7_SIZE                                  0x1
#define _ODCOND_ODCD7_LENGTH                                0x1
#define _ODCOND_ODCD7_MASK                                  0x80

// Register: WPUD
#define WPUD WPUD
extern volatile unsigned char           WPUD                __at(0xEA6);
#ifndef _LIB_BUILD
asm("WPUD equ 0EA6h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned WPUD0                  :1;
        unsigned WPUD1                  :1;
        unsigned WPUD2                  :1;
        unsigned WPUD3                  :1;
        unsigned WPUD4                  :1;
        unsigned WPUD5                  :1;
        unsigned WPUD6                  :1;
        unsigned WPUD7                  :1;
    };
} WPUDbits_t;
extern volatile WPUDbits_t WPUDbits __at(0xEA6);
// bitfield macros
#define _WPUD_WPUD0_POSN                                    0x0
#define _WPUD_WPUD0_POSITION                                0x0
#define _WPUD_WPUD0_SIZE                                    0x1
#define _WPUD_WPUD0_LENGTH                                  0x1
#define _WPUD_WPUD0_MASK                                    0x1
#define _WPUD_WPUD1_POSN                                    0x1
#define _WPUD_WPUD1_POSITION                                0x1
#define _WPUD_WPUD1_SIZE                                    0x1
#define _WPUD_WPUD1_LENGTH                                  0x1
#define _WPUD_WPUD1_MASK                                    0x2
#define _WPUD_WPUD2_POSN                                    0x2
#define _WPUD_WPUD2_POSITION                                0x2
#define _WPUD_WPUD2_SIZE                                    0x1
#define _WPUD_WPUD2_LENGTH                                  0x1
#define _WPUD_WPUD2_MASK                                    0x4
#define _WPUD_WPUD3_POSN                                    0x3
#define _WPUD_WPUD3_POSITION                                0x3
#define _WPUD_WPUD3_SIZE                                    0x1
#define _WPUD_WPUD3_LENGTH                                  0x1
#define _WPUD_WPUD3_MASK                                    0x8
#define _WPUD_WPUD4_POSN                                    0x4
#define _WPUD_WPUD4_POSITION                                0x4
#define _WPUD_WPUD4_SIZE                                    0x1
#define _WPUD_WPUD4_LENGTH                                  0x1
#define _WPUD_WPUD4_MASK                                    0x10
#define _WPUD_WPUD5_POSN                                    0x5
#define _WPUD_WPUD5_POSITION                                0x5
#define _WPUD_WPUD5_SIZE                                    0x1
#define _WPUD_WPUD5_LENGTH                                  0x1
#define _WPUD_WPUD5_MASK                                    0x20
#define _WPUD_WPUD6_POSN                                    0x6
#define _WPUD_WPUD6_POSITION                                0x6
#define _WPUD_WPUD6_SIZE                                    0x1
#define _WPUD_WPUD6_LENGTH                                  0x1
#define _WPUD_WPUD6_MASK                                    0x40
#define _WPUD_WPUD7_POSN                                    0x7
#define _WPUD_WPUD7_POSITION                                0x7
#define _WPUD_WPUD7_SIZE                                    0x1
#define _WPUD_WPUD7_LENGTH                                  0x1
#define _WPUD_WPUD7_MASK                                    0x80

// Register: ANSELD
#define ANSELD ANSELD
extern volatile unsigned char           ANSELD              __at(0xEA7);
#ifndef _LIB_BUILD
asm("ANSELD equ 0EA7h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ANSELD0                :1;
        unsigned ANSELD1                :1;
        unsigned ANSELD2                :1;
        unsigned ANSELD3                :1;
        unsigned ANSELD4                :1;
        unsigned ANSELD5                :1;
        unsigned ANSELD6                :1;
        unsigned ANSELD7                :1;
    };
} ANSELDbits_t;
