MikroElektronika/core_packages/PIC/XC8/def/PIC18LF65K40/mcu.h
extern volatile IOCENbits_t IOCENbits __at(0xEA9);
// bitfield macros
#define _IOCEN_IOCEN0_POSN                                  0x0
#define _IOCEN_IOCEN0_POSITION                              0x0
#define _IOCEN_IOCEN0_SIZE                                  0x1
#define _IOCEN_IOCEN0_LENGTH                                0x1
#define _IOCEN_IOCEN0_MASK                                  0x1
#define _IOCEN_IOCEN1_POSN                                  0x1
#define _IOCEN_IOCEN1_POSITION                              0x1
#define _IOCEN_IOCEN1_SIZE                                  0x1
#define _IOCEN_IOCEN1_LENGTH                                0x1
#define _IOCEN_IOCEN1_MASK                                  0x2
#define _IOCEN_IOCEN2_POSN                                  0x2
#define _IOCEN_IOCEN2_POSITION                              0x2
#define _IOCEN_IOCEN2_SIZE                                  0x1
#define _IOCEN_IOCEN2_LENGTH                                0x1
#define _IOCEN_IOCEN2_MASK                                  0x4
#define _IOCEN_IOCEN3_POSN                                  0x3
#define _IOCEN_IOCEN3_POSITION                              0x3
#define _IOCEN_IOCEN3_SIZE                                  0x1
#define _IOCEN_IOCEN3_LENGTH                                0x1
#define _IOCEN_IOCEN3_MASK                                  0x8
#define _IOCEN_IOCEN4_POSN                                  0x4
#define _IOCEN_IOCEN4_POSITION                              0x4
#define _IOCEN_IOCEN4_SIZE                                  0x1
#define _IOCEN_IOCEN4_LENGTH                                0x1
#define _IOCEN_IOCEN4_MASK                                  0x10
#define _IOCEN_IOCEN5_POSN                                  0x5
#define _IOCEN_IOCEN5_POSITION                              0x5
#define _IOCEN_IOCEN5_SIZE                                  0x1
#define _IOCEN_IOCEN5_LENGTH                                0x1
#define _IOCEN_IOCEN5_MASK                                  0x20
#define _IOCEN_IOCEN6_POSN                                  0x6
#define _IOCEN_IOCEN6_POSITION                              0x6
#define _IOCEN_IOCEN6_SIZE                                  0x1
#define _IOCEN_IOCEN6_LENGTH                                0x1
#define _IOCEN_IOCEN6_MASK                                  0x40
#define _IOCEN_IOCEN7_POSN                                  0x7
#define _IOCEN_IOCEN7_POSITION                              0x7
#define _IOCEN_IOCEN7_SIZE                                  0x1
#define _IOCEN_IOCEN7_LENGTH                                0x1
#define _IOCEN_IOCEN7_MASK                                  0x80

// Register: IOCEP
#define IOCEP IOCEP
extern volatile unsigned char           IOCEP               __at(0xEAA);
#ifndef _LIB_BUILD
asm("IOCEP equ 0EAAh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned IOCEP0                 :1;
        unsigned IOCEP1                 :1;
        unsigned IOCEP2                 :1;
        unsigned IOCEP3                 :1;
        unsigned IOCEP4                 :1;
        unsigned IOCEP5                 :1;
        unsigned IOCEP6                 :1;
        unsigned IOCEP7                 :1;
    };
} IOCEPbits_t;
extern volatile IOCEPbits_t IOCEPbits __at(0xEAA);
// bitfield macros
#define _IOCEP_IOCEP0_POSN                                  0x0
#define _IOCEP_IOCEP0_POSITION                              0x0
#define _IOCEP_IOCEP0_SIZE                                  0x1
#define _IOCEP_IOCEP0_LENGTH                                0x1
#define _IOCEP_IOCEP0_MASK                                  0x1
#define _IOCEP_IOCEP1_POSN                                  0x1
#define _IOCEP_IOCEP1_POSITION                              0x1
#define _IOCEP_IOCEP1_SIZE                                  0x1
#define _IOCEP_IOCEP1_LENGTH                                0x1
#define _IOCEP_IOCEP1_MASK                                  0x2
#define _IOCEP_IOCEP2_POSN                                  0x2
#define _IOCEP_IOCEP2_POSITION                              0x2
#define _IOCEP_IOCEP2_SIZE                                  0x1
#define _IOCEP_IOCEP2_LENGTH                                0x1
#define _IOCEP_IOCEP2_MASK                                  0x4
#define _IOCEP_IOCEP3_POSN                                  0x3
#define _IOCEP_IOCEP3_POSITION                              0x3
#define _IOCEP_IOCEP3_SIZE                                  0x1
#define _IOCEP_IOCEP3_LENGTH                                0x1
#define _IOCEP_IOCEP3_MASK                                  0x8
#define _IOCEP_IOCEP4_POSN                                  0x4
#define _IOCEP_IOCEP4_POSITION                              0x4
#define _IOCEP_IOCEP4_SIZE                                  0x1
#define _IOCEP_IOCEP4_LENGTH                                0x1
#define _IOCEP_IOCEP4_MASK                                  0x10
#define _IOCEP_IOCEP5_POSN                                  0x5
#define _IOCEP_IOCEP5_POSITION                              0x5
#define _IOCEP_IOCEP5_SIZE                                  0x1
#define _IOCEP_IOCEP5_LENGTH                                0x1
#define _IOCEP_IOCEP5_MASK                                  0x20
#define _IOCEP_IOCEP6_POSN                                  0x6
#define _IOCEP_IOCEP6_POSITION                              0x6
#define _IOCEP_IOCEP6_SIZE                                  0x1
#define _IOCEP_IOCEP6_LENGTH                                0x1
#define _IOCEP_IOCEP6_MASK                                  0x40
#define _IOCEP_IOCEP7_POSN                                  0x7
#define _IOCEP_IOCEP7_POSITION                              0x7
#define _IOCEP_IOCEP7_SIZE                                  0x1
#define _IOCEP_IOCEP7_LENGTH                                0x1
#define _IOCEP_IOCEP7_MASK                                  0x80

// Register: INLVLE
#define INLVLE INLVLE
extern volatile unsigned char           INLVLE              __at(0xEAB);
#ifndef _LIB_BUILD
asm("INLVLE equ 0EABh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned INLVLE0                :1;
        unsigned INLVLE1                :1;
        unsigned INLVLE2                :1;
        unsigned INLVLE3                :1;
        unsigned INLVLE4                :1;
        unsigned INLVLE5                :1;
        unsigned INLVLE6                :1;
        unsigned INLVLE7                :1;
    };
} INLVLEbits_t;
extern volatile INLVLEbits_t INLVLEbits __at(0xEAB);
// bitfield macros
#define _INLVLE_INLVLE0_POSN                                0x0
#define _INLVLE_INLVLE0_POSITION                            0x0
#define _INLVLE_INLVLE0_SIZE                                0x1
#define _INLVLE_INLVLE0_LENGTH                              0x1
#define _INLVLE_INLVLE0_MASK                                0x1
#define _INLVLE_INLVLE1_POSN                                0x1
#define _INLVLE_INLVLE1_POSITION                            0x1
#define _INLVLE_INLVLE1_SIZE                                0x1
#define _INLVLE_INLVLE1_LENGTH                              0x1
#define _INLVLE_INLVLE1_MASK                                0x2
#define _INLVLE_INLVLE2_POSN                                0x2
#define _INLVLE_INLVLE2_POSITION                            0x2
#define _INLVLE_INLVLE2_SIZE                                0x1
#define _INLVLE_INLVLE2_LENGTH                              0x1
#define _INLVLE_INLVLE2_MASK                                0x4
#define _INLVLE_INLVLE3_POSN                                0x3
#define _INLVLE_INLVLE3_POSITION                            0x3
#define _INLVLE_INLVLE3_SIZE                                0x1
#define _INLVLE_INLVLE3_LENGTH                              0x1
#define _INLVLE_INLVLE3_MASK                                0x8
#define _INLVLE_INLVLE4_POSN                                0x4
#define _INLVLE_INLVLE4_POSITION                            0x4
#define _INLVLE_INLVLE4_SIZE                                0x1
#define _INLVLE_INLVLE4_LENGTH                              0x1
#define _INLVLE_INLVLE4_MASK                                0x10
#define _INLVLE_INLVLE5_POSN                                0x5
#define _INLVLE_INLVLE5_POSITION                            0x5
#define _INLVLE_INLVLE5_SIZE                                0x1
#define _INLVLE_INLVLE5_LENGTH                              0x1
#define _INLVLE_INLVLE5_MASK                                0x20
#define _INLVLE_INLVLE6_POSN                                0x6
#define _INLVLE_INLVLE6_POSITION                            0x6
#define _INLVLE_INLVLE6_SIZE                                0x1
#define _INLVLE_INLVLE6_LENGTH                              0x1
#define _INLVLE_INLVLE6_MASK                                0x40
#define _INLVLE_INLVLE7_POSN                                0x7
#define _INLVLE_INLVLE7_POSITION                            0x7
#define _INLVLE_INLVLE7_SIZE                                0x1
#define _INLVLE_INLVLE7_LENGTH                              0x1
#define _INLVLE_INLVLE7_MASK                                0x80

// Register: SLRCONE
#define SLRCONE SLRCONE
extern volatile unsigned char           SLRCONE             __at(0xEAC);
#ifndef _LIB_BUILD
asm("SLRCONE equ 0EACh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SLRE0                  :1;
        unsigned SLRE1                  :1;
        unsigned SLRE2                  :1;
        unsigned SLRE3                  :1;
        unsigned SLRE4                  :1;
        unsigned SLRE5                  :1;
        unsigned SLRE6                  :1;
        unsigned SLRE7                  :1;
    };
} SLRCONEbits_t;
extern volatile SLRCONEbits_t SLRCONEbits __at(0xEAC);
// bitfield macros
#define _SLRCONE_SLRE0_POSN                                 0x0
#define _SLRCONE_SLRE0_POSITION                             0x0
#define _SLRCONE_SLRE0_SIZE                                 0x1
#define _SLRCONE_SLRE0_LENGTH                               0x1
#define _SLRCONE_SLRE0_MASK                                 0x1
#define _SLRCONE_SLRE1_POSN                                 0x1
#define _SLRCONE_SLRE1_POSITION                             0x1
#define _SLRCONE_SLRE1_SIZE                                 0x1
#define _SLRCONE_SLRE1_LENGTH                               0x1
#define _SLRCONE_SLRE1_MASK                                 0x2
#define _SLRCONE_SLRE2_POSN                                 0x2
#define _SLRCONE_SLRE2_POSITION                             0x2
#define _SLRCONE_SLRE2_SIZE                                 0x1
#define _SLRCONE_SLRE2_LENGTH                               0x1
#define _SLRCONE_SLRE2_MASK                                 0x4
#define _SLRCONE_SLRE3_POSN                                 0x3
#define _SLRCONE_SLRE3_POSITION                             0x3
#define _SLRCONE_SLRE3_SIZE                                 0x1
#define _SLRCONE_SLRE3_LENGTH                               0x1
#define _SLRCONE_SLRE3_MASK                                 0x8
#define _SLRCONE_SLRE4_POSN                                 0x4
#define _SLRCONE_SLRE4_POSITION                             0x4
#define _SLRCONE_SLRE4_SIZE                                 0x1
#define _SLRCONE_SLRE4_LENGTH                               0x1
#define _SLRCONE_SLRE4_MASK                                 0x10
#define _SLRCONE_SLRE5_POSN                                 0x5
#define _SLRCONE_SLRE5_POSITION                             0x5
#define _SLRCONE_SLRE5_SIZE                                 0x1
#define _SLRCONE_SLRE5_LENGTH                               0x1
#define _SLRCONE_SLRE5_MASK                                 0x20
#define _SLRCONE_SLRE6_POSN                                 0x6
#define _SLRCONE_SLRE6_POSITION                             0x6
#define _SLRCONE_SLRE6_SIZE                                 0x1
#define _SLRCONE_SLRE6_LENGTH                               0x1
#define _SLRCONE_SLRE6_MASK                                 0x40
#define _SLRCONE_SLRE7_POSN                                 0x7
#define _SLRCONE_SLRE7_POSITION                             0x7
#define _SLRCONE_SLRE7_SIZE                                 0x1
#define _SLRCONE_SLRE7_LENGTH                               0x1
#define _SLRCONE_SLRE7_MASK                                 0x80

// Register: ODCONE
#define ODCONE ODCONE
extern volatile unsigned char           ODCONE              __at(0xEAD);
#ifndef _LIB_BUILD
asm("ODCONE equ 0EADh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ODCE0                  :1;
        unsigned ODCE1                  :1;
        unsigned ODCE2                  :1;
        unsigned ODCE3                  :1;
        unsigned ODCE4                  :1;
        unsigned ODCE5                  :1;
        unsigned ODCE6                  :1;
        unsigned ODCE7                  :1;
    };
} ODCONEbits_t;
extern volatile ODCONEbits_t ODCONEbits __at(0xEAD);
// bitfield macros
#define _ODCONE_ODCE0_POSN                                  0x0
#define _ODCONE_ODCE0_POSITION                              0x0
#define _ODCONE_ODCE0_SIZE                                  0x1
#define _ODCONE_ODCE0_LENGTH                                0x1
#define _ODCONE_ODCE0_MASK                                  0x1
#define _ODCONE_ODCE1_POSN                                  0x1
#define _ODCONE_ODCE1_POSITION                              0x1
#define _ODCONE_ODCE1_SIZE                                  0x1
#define _ODCONE_ODCE1_LENGTH                                0x1
#define _ODCONE_ODCE1_MASK                                  0x2
#define _ODCONE_ODCE2_POSN                                  0x2
#define _ODCONE_ODCE2_POSITION                              0x2
#define _ODCONE_ODCE2_SIZE                                  0x1
#define _ODCONE_ODCE2_LENGTH                                0x1
#define _ODCONE_ODCE2_MASK                                  0x4
#define _ODCONE_ODCE3_POSN                                  0x3
#define _ODCONE_ODCE3_POSITION                              0x3
#define _ODCONE_ODCE3_SIZE                                  0x1
#define _ODCONE_ODCE3_LENGTH                                0x1
#define _ODCONE_ODCE3_MASK                                  0x8
#define _ODCONE_ODCE4_POSN                                  0x4
#define _ODCONE_ODCE4_POSITION                              0x4
#define _ODCONE_ODCE4_SIZE                                  0x1
#define _ODCONE_ODCE4_LENGTH                                0x1
#define _ODCONE_ODCE4_MASK                                  0x10
#define _ODCONE_ODCE5_POSN                                  0x5
#define _ODCONE_ODCE5_POSITION                              0x5
#define _ODCONE_ODCE5_SIZE                                  0x1
#define _ODCONE_ODCE5_LENGTH                                0x1
#define _ODCONE_ODCE5_MASK                                  0x20
#define _ODCONE_ODCE6_POSN                                  0x6
#define _ODCONE_ODCE6_POSITION                              0x6
#define _ODCONE_ODCE6_SIZE                                  0x1
#define _ODCONE_ODCE6_LENGTH                                0x1
#define _ODCONE_ODCE6_MASK                                  0x40
#define _ODCONE_ODCE7_POSN                                  0x7
#define _ODCONE_ODCE7_POSITION                              0x7
#define _ODCONE_ODCE7_SIZE                                  0x1
#define _ODCONE_ODCE7_LENGTH                                0x1
#define _ODCONE_ODCE7_MASK                                  0x80

// Register: WPUE
#define WPUE WPUE
extern volatile unsigned char           WPUE                __at(0xEAE);
#ifndef _LIB_BUILD
asm("WPUE equ 0EAEh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned WPUE0                  :1;
        unsigned WPUE1                  :1;
        unsigned WPUE2                  :1;
        unsigned WPUE3                  :1;
        unsigned WPUE4                  :1;
        unsigned WPUE5                  :1;
        unsigned WPUE6                  :1;
        unsigned WPUE7                  :1;
    };
} WPUEbits_t;
extern volatile WPUEbits_t WPUEbits __at(0xEAE);
// bitfield macros
#define _WPUE_WPUE0_POSN                                    0x0
#define _WPUE_WPUE0_POSITION                                0x0
#define _WPUE_WPUE0_SIZE                                    0x1
#define _WPUE_WPUE0_LENGTH                                  0x1
#define _WPUE_WPUE0_MASK                                    0x1
#define _WPUE_WPUE1_POSN                                    0x1
#define _WPUE_WPUE1_POSITION                                0x1
#define _WPUE_WPUE1_SIZE                                    0x1
#define _WPUE_WPUE1_LENGTH                                  0x1
#define _WPUE_WPUE1_MASK                                    0x2
#define _WPUE_WPUE2_POSN                                    0x2
#define _WPUE_WPUE2_POSITION                                0x2
#define _WPUE_WPUE2_SIZE                                    0x1
#define _WPUE_WPUE2_LENGTH                                  0x1
#define _WPUE_WPUE2_MASK                                    0x4
#define _WPUE_WPUE3_POSN                                    0x3
#define _WPUE_WPUE3_POSITION                                0x3
#define _WPUE_WPUE3_SIZE                                    0x1
#define _WPUE_WPUE3_LENGTH                                  0x1
#define _WPUE_WPUE3_MASK                                    0x8
#define _WPUE_WPUE4_POSN                                    0x4
#define _WPUE_WPUE4_POSITION                                0x4
#define _WPUE_WPUE4_SIZE                                    0x1
#define _WPUE_WPUE4_LENGTH                                  0x1
#define _WPUE_WPUE4_MASK                                    0x10
#define _WPUE_WPUE5_POSN                                    0x5
#define _WPUE_WPUE5_POSITION                                0x5
#define _WPUE_WPUE5_SIZE                                    0x1
#define _WPUE_WPUE5_LENGTH                                  0x1
#define _WPUE_WPUE5_MASK                                    0x20
#define _WPUE_WPUE6_POSN                                    0x6
#define _WPUE_WPUE6_POSITION                                0x6
#define _WPUE_WPUE6_SIZE                                    0x1
#define _WPUE_WPUE6_LENGTH                                  0x1
#define _WPUE_WPUE6_MASK                                    0x40
#define _WPUE_WPUE7_POSN                                    0x7
#define _WPUE_WPUE7_POSITION                                0x7
#define _WPUE_WPUE7_SIZE                                    0x1
#define _WPUE_WPUE7_LENGTH                                  0x1
#define _WPUE_WPUE7_MASK                                    0x80

