MikroElektronika/core_packages/PIC/XC8/def/PIC18LF65K40/mcu.h
// Register: CCPR3L
#define CCPR3L CCPR3L
extern volatile unsigned char           CCPR3L              __at(0xF24);
#ifndef _LIB_BUILD
asm("CCPR3L equ 0F24h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RL                     :8;
    };
} CCPR3Lbits_t;
extern volatile CCPR3Lbits_t CCPR3Lbits __at(0xF24);
// bitfield macros
#define _CCPR3L_RL_POSN                                     0x0
#define _CCPR3L_RL_POSITION                                 0x0
#define _CCPR3L_RL_SIZE                                     0x8
#define _CCPR3L_RL_LENGTH                                   0x8
#define _CCPR3L_RL_MASK                                     0xFF

// Register: CCPR3H
#define CCPR3H CCPR3H
extern volatile unsigned char           CCPR3H              __at(0xF25);
#ifndef _LIB_BUILD
asm("CCPR3H equ 0F25h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RH                     :8;
    };
} CCPR3Hbits_t;
extern volatile CCPR3Hbits_t CCPR3Hbits __at(0xF25);
// bitfield macros
#define _CCPR3H_RH_POSN                                     0x0
#define _CCPR3H_RH_POSITION                                 0x0
#define _CCPR3H_RH_SIZE                                     0x8
#define _CCPR3H_RH_LENGTH                                   0x8
#define _CCPR3H_RH_MASK                                     0xFF

// Register: CCP3CON
#define CCP3CON CCP3CON
extern volatile unsigned char           CCP3CON             __at(0xF26);
#ifndef _LIB_BUILD
asm("CCP3CON equ 0F26h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned MODE                   :4;
        unsigned FMT                    :1;
        unsigned OUT                    :1;
        unsigned OE                     :1;
        unsigned EN                     :1;
    };
    struct {
        unsigned MODE0                  :1;
        unsigned MODE1                  :1;
        unsigned MODE2                  :1;
        unsigned MODE3                  :1;
    };
    struct {
        unsigned CCP3MODE               :4;
        unsigned CCP3FMT                :1;
        unsigned CCP3OUT                :1;
        unsigned CCP3OE                 :1;
        unsigned CCP3EN                 :1;
    };
    struct {
        unsigned CCP3MODE0              :1;
        unsigned CCP3MODE1              :1;
        unsigned CCP3MODE2              :1;
        unsigned CCP3MODE3              :1;
    };
} CCP3CONbits_t;
extern volatile CCP3CONbits_t CCP3CONbits __at(0xF26);
// bitfield macros
#define _CCP3CON_MODE_POSN                                  0x0
#define _CCP3CON_MODE_POSITION                              0x0
#define _CCP3CON_MODE_SIZE                                  0x4
#define _CCP3CON_MODE_LENGTH                                0x4
#define _CCP3CON_MODE_MASK                                  0xF
#define _CCP3CON_FMT_POSN                                   0x4
#define _CCP3CON_FMT_POSITION                               0x4
#define _CCP3CON_FMT_SIZE                                   0x1
#define _CCP3CON_FMT_LENGTH                                 0x1
#define _CCP3CON_FMT_MASK                                   0x10
#define _CCP3CON_OUT_POSN                                   0x5
#define _CCP3CON_OUT_POSITION                               0x5
#define _CCP3CON_OUT_SIZE                                   0x1
#define _CCP3CON_OUT_LENGTH                                 0x1
#define _CCP3CON_OUT_MASK                                   0x20
#define _CCP3CON_OE_POSN                                    0x6
#define _CCP3CON_OE_POSITION                                0x6
#define _CCP3CON_OE_SIZE                                    0x1
#define _CCP3CON_OE_LENGTH                                  0x1
#define _CCP3CON_OE_MASK                                    0x40
#define _CCP3CON_EN_POSN                                    0x7
#define _CCP3CON_EN_POSITION                                0x7
#define _CCP3CON_EN_SIZE                                    0x1
#define _CCP3CON_EN_LENGTH                                  0x1
#define _CCP3CON_EN_MASK                                    0x80
#define _CCP3CON_MODE0_POSN                                 0x0
#define _CCP3CON_MODE0_POSITION                             0x0
#define _CCP3CON_MODE0_SIZE                                 0x1
#define _CCP3CON_MODE0_LENGTH                               0x1
#define _CCP3CON_MODE0_MASK                                 0x1
#define _CCP3CON_MODE1_POSN                                 0x1
#define _CCP3CON_MODE1_POSITION                             0x1
#define _CCP3CON_MODE1_SIZE                                 0x1
#define _CCP3CON_MODE1_LENGTH                               0x1
#define _CCP3CON_MODE1_MASK                                 0x2
#define _CCP3CON_MODE2_POSN                                 0x2
#define _CCP3CON_MODE2_POSITION                             0x2
#define _CCP3CON_MODE2_SIZE                                 0x1
#define _CCP3CON_MODE2_LENGTH                               0x1
#define _CCP3CON_MODE2_MASK                                 0x4
#define _CCP3CON_MODE3_POSN                                 0x3
#define _CCP3CON_MODE3_POSITION                             0x3
#define _CCP3CON_MODE3_SIZE                                 0x1
#define _CCP3CON_MODE3_LENGTH                               0x1
#define _CCP3CON_MODE3_MASK                                 0x8
#define _CCP3CON_CCP3MODE_POSN                              0x0
#define _CCP3CON_CCP3MODE_POSITION                          0x0
#define _CCP3CON_CCP3MODE_SIZE                              0x4
#define _CCP3CON_CCP3MODE_LENGTH                            0x4
#define _CCP3CON_CCP3MODE_MASK                              0xF
#define _CCP3CON_CCP3FMT_POSN                               0x4
#define _CCP3CON_CCP3FMT_POSITION                           0x4
#define _CCP3CON_CCP3FMT_SIZE                               0x1
#define _CCP3CON_CCP3FMT_LENGTH                             0x1
#define _CCP3CON_CCP3FMT_MASK                               0x10
#define _CCP3CON_CCP3OUT_POSN                               0x5
#define _CCP3CON_CCP3OUT_POSITION                           0x5
#define _CCP3CON_CCP3OUT_SIZE                               0x1
#define _CCP3CON_CCP3OUT_LENGTH                             0x1
#define _CCP3CON_CCP3OUT_MASK                               0x20
#define _CCP3CON_CCP3OE_POSN                                0x6
#define _CCP3CON_CCP3OE_POSITION                            0x6
#define _CCP3CON_CCP3OE_SIZE                                0x1
#define _CCP3CON_CCP3OE_LENGTH                              0x1
#define _CCP3CON_CCP3OE_MASK                                0x40
#define _CCP3CON_CCP3EN_POSN                                0x7
#define _CCP3CON_CCP3EN_POSITION                            0x7
#define _CCP3CON_CCP3EN_SIZE                                0x1
#define _CCP3CON_CCP3EN_LENGTH                              0x1
#define _CCP3CON_CCP3EN_MASK                                0x80
#define _CCP3CON_CCP3MODE0_POSN                             0x0
#define _CCP3CON_CCP3MODE0_POSITION                         0x0
#define _CCP3CON_CCP3MODE0_SIZE                             0x1
#define _CCP3CON_CCP3MODE0_LENGTH                           0x1
#define _CCP3CON_CCP3MODE0_MASK                             0x1
#define _CCP3CON_CCP3MODE1_POSN                             0x1
#define _CCP3CON_CCP3MODE1_POSITION                         0x1
#define _CCP3CON_CCP3MODE1_SIZE                             0x1
#define _CCP3CON_CCP3MODE1_LENGTH                           0x1
#define _CCP3CON_CCP3MODE1_MASK                             0x2
#define _CCP3CON_CCP3MODE2_POSN                             0x2
#define _CCP3CON_CCP3MODE2_POSITION                         0x2
#define _CCP3CON_CCP3MODE2_SIZE                             0x1
#define _CCP3CON_CCP3MODE2_LENGTH                           0x1
#define _CCP3CON_CCP3MODE2_MASK                             0x4
#define _CCP3CON_CCP3MODE3_POSN                             0x3
#define _CCP3CON_CCP3MODE3_POSITION                         0x3
#define _CCP3CON_CCP3MODE3_SIZE                             0x1
#define _CCP3CON_CCP3MODE3_LENGTH                           0x1
#define _CCP3CON_CCP3MODE3_MASK                             0x8

// Register: CCP3CAP
#define CCP3CAP CCP3CAP
extern volatile unsigned char           CCP3CAP             __at(0xF27);
#ifndef _LIB_BUILD
asm("CCP3CAP equ 0F27h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CTS                    :8;
    };
    struct {
        unsigned CTS0                   :1;
        unsigned CTS1                   :1;
        unsigned CTS2                   :1;
        unsigned CTS3                   :1;
        unsigned CTS4                   :1;
        unsigned CTS5                   :1;
        unsigned CTS6                   :1;
        unsigned CTS7                   :1;
    };
    struct {
        unsigned CCP3CTS                :8;
    };
    struct {
        unsigned CCP3CTS0               :1;
        unsigned CCP3CTS1               :1;
        unsigned CCP3CTS2               :1;
        unsigned CCP3CTS3               :1;
        unsigned CCP3CTS4               :1;
        unsigned CCP3CTS5               :1;
        unsigned CCP3CTS6               :1;
        unsigned CCP3CTS7               :1;
    };
} CCP3CAPbits_t;
extern volatile CCP3CAPbits_t CCP3CAPbits __at(0xF27);
// bitfield macros
#define _CCP3CAP_CTS_POSN                                   0x0
#define _CCP3CAP_CTS_POSITION                               0x0
#define _CCP3CAP_CTS_SIZE                                   0x8
#define _CCP3CAP_CTS_LENGTH                                 0x8
#define _CCP3CAP_CTS_MASK                                   0xFF
#define _CCP3CAP_CTS0_POSN                                  0x0
#define _CCP3CAP_CTS0_POSITION                              0x0
#define _CCP3CAP_CTS0_SIZE                                  0x1
#define _CCP3CAP_CTS0_LENGTH                                0x1
#define _CCP3CAP_CTS0_MASK                                  0x1
#define _CCP3CAP_CTS1_POSN                                  0x1
#define _CCP3CAP_CTS1_POSITION                              0x1
#define _CCP3CAP_CTS1_SIZE                                  0x1
#define _CCP3CAP_CTS1_LENGTH                                0x1
#define _CCP3CAP_CTS1_MASK                                  0x2
#define _CCP3CAP_CTS2_POSN                                  0x2
#define _CCP3CAP_CTS2_POSITION                              0x2
#define _CCP3CAP_CTS2_SIZE                                  0x1
#define _CCP3CAP_CTS2_LENGTH                                0x1
#define _CCP3CAP_CTS2_MASK                                  0x4
#define _CCP3CAP_CTS3_POSN                                  0x3
#define _CCP3CAP_CTS3_POSITION                              0x3
#define _CCP3CAP_CTS3_SIZE                                  0x1
#define _CCP3CAP_CTS3_LENGTH                                0x1
#define _CCP3CAP_CTS3_MASK                                  0x8
#define _CCP3CAP_CTS4_POSN                                  0x4
#define _CCP3CAP_CTS4_POSITION                              0x4
#define _CCP3CAP_CTS4_SIZE                                  0x1
#define _CCP3CAP_CTS4_LENGTH                                0x1
#define _CCP3CAP_CTS4_MASK                                  0x10
#define _CCP3CAP_CTS5_POSN                                  0x5
#define _CCP3CAP_CTS5_POSITION                              0x5
#define _CCP3CAP_CTS5_SIZE                                  0x1
#define _CCP3CAP_CTS5_LENGTH                                0x1
#define _CCP3CAP_CTS5_MASK                                  0x20
#define _CCP3CAP_CTS6_POSN                                  0x6
#define _CCP3CAP_CTS6_POSITION                              0x6
#define _CCP3CAP_CTS6_SIZE                                  0x1
#define _CCP3CAP_CTS6_LENGTH                                0x1
#define _CCP3CAP_CTS6_MASK                                  0x40
#define _CCP3CAP_CTS7_POSN                                  0x7
#define _CCP3CAP_CTS7_POSITION                              0x7
#define _CCP3CAP_CTS7_SIZE                                  0x1
#define _CCP3CAP_CTS7_LENGTH                                0x1
#define _CCP3CAP_CTS7_MASK                                  0x80
#define _CCP3CAP_CCP3CTS_POSN                               0x0
#define _CCP3CAP_CCP3CTS_POSITION                           0x0
#define _CCP3CAP_CCP3CTS_SIZE                               0x8
#define _CCP3CAP_CCP3CTS_LENGTH                             0x8
#define _CCP3CAP_CCP3CTS_MASK                               0xFF
#define _CCP3CAP_CCP3CTS0_POSN                              0x0
#define _CCP3CAP_CCP3CTS0_POSITION                          0x0
#define _CCP3CAP_CCP3CTS0_SIZE                              0x1
#define _CCP3CAP_CCP3CTS0_LENGTH                            0x1
#define _CCP3CAP_CCP3CTS0_MASK                              0x1
#define _CCP3CAP_CCP3CTS1_POSN                              0x1
#define _CCP3CAP_CCP3CTS1_POSITION                          0x1
#define _CCP3CAP_CCP3CTS1_SIZE                              0x1
#define _CCP3CAP_CCP3CTS1_LENGTH                            0x1
#define _CCP3CAP_CCP3CTS1_MASK                              0x2
#define _CCP3CAP_CCP3CTS2_POSN                              0x2
#define _CCP3CAP_CCP3CTS2_POSITION                          0x2
#define _CCP3CAP_CCP3CTS2_SIZE                              0x1
#define _CCP3CAP_CCP3CTS2_LENGTH                            0x1
#define _CCP3CAP_CCP3CTS2_MASK                              0x4
#define _CCP3CAP_CCP3CTS3_POSN                              0x3
#define _CCP3CAP_CCP3CTS3_POSITION                          0x3
#define _CCP3CAP_CCP3CTS3_SIZE                              0x1
#define _CCP3CAP_CCP3CTS3_LENGTH                            0x1
#define _CCP3CAP_CCP3CTS3_MASK                              0x8
#define _CCP3CAP_CCP3CTS4_POSN                              0x4
#define _CCP3CAP_CCP3CTS4_POSITION                          0x4
#define _CCP3CAP_CCP3CTS4_SIZE                              0x1
#define _CCP3CAP_CCP3CTS4_LENGTH                            0x1
#define _CCP3CAP_CCP3CTS4_MASK                              0x10
#define _CCP3CAP_CCP3CTS5_POSN                              0x5
#define _CCP3CAP_CCP3CTS5_POSITION                          0x5
#define _CCP3CAP_CCP3CTS5_SIZE                              0x1
#define _CCP3CAP_CCP3CTS5_LENGTH                            0x1
#define _CCP3CAP_CCP3CTS5_MASK                              0x20
#define _CCP3CAP_CCP3CTS6_POSN                              0x6
#define _CCP3CAP_CCP3CTS6_POSITION                          0x6
#define _CCP3CAP_CCP3CTS6_SIZE                              0x1
#define _CCP3CAP_CCP3CTS6_LENGTH                            0x1
#define _CCP3CAP_CCP3CTS6_MASK                              0x40
#define _CCP3CAP_CCP3CTS7_POSN                              0x7
#define _CCP3CAP_CCP3CTS7_POSITION                          0x7
#define _CCP3CAP_CCP3CTS7_SIZE                              0x1
#define _CCP3CAP_CCP3CTS7_LENGTH                            0x1
#define _CCP3CAP_CCP3CTS7_MASK                              0x80

// Register: T8TMR
#define T8TMR T8TMR
extern volatile unsigned char           T8TMR               __at(0xF28);
#ifndef _LIB_BUILD
asm("T8TMR equ 0F28h");
#endif
// aliases
extern volatile unsigned char           TMR8                __at(0xF28);
#ifndef _LIB_BUILD
asm("TMR8 equ 0F28h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TMR                    :8;
    };
    struct {
        unsigned TMR8                   :8;
    };
} T8TMRbits_t;
extern volatile T8TMRbits_t T8TMRbits __at(0xF28);
// bitfield macros
#define _T8TMR_TMR_POSN                                     0x0
#define _T8TMR_TMR_POSITION                                 0x0
#define _T8TMR_TMR_SIZE                                     0x8
#define _T8TMR_TMR_LENGTH                                   0x8
#define _T8TMR_TMR_MASK                                     0xFF
#define _T8TMR_TMR8_POSN                                    0x0
#define _T8TMR_TMR8_POSITION                                0x0
#define _T8TMR_TMR8_SIZE                                    0x8
#define _T8TMR_TMR8_LENGTH                                  0x8
#define _T8TMR_TMR8_MASK                                    0xFF
// alias bitfield definitions
typedef union {
    struct {
        unsigned TMR                    :8;
    };
    struct {
        unsigned TMR8                   :8;
    };
} TMR8bits_t;
extern volatile TMR8bits_t TMR8bits __at(0xF28);
// bitfield macros
#define _TMR8_TMR_POSN                                      0x0
#define _TMR8_TMR_POSITION                                  0x0
#define _TMR8_TMR_SIZE                                      0x8
#define _TMR8_TMR_LENGTH                                    0x8
#define _TMR8_TMR_MASK                                      0xFF
#define _TMR8_TMR8_POSN                                     0x0
#define _TMR8_TMR8_POSITION                                 0x0
#define _TMR8_TMR8_SIZE                                     0x8
#define _TMR8_TMR8_LENGTH                                   0x8
#define _TMR8_TMR8_MASK                                     0xFF

// Register: T8PR
#define T8PR T8PR
extern volatile unsigned char           T8PR                __at(0xF29);
#ifndef _LIB_BUILD
asm("T8PR equ 0F29h");
#endif
// aliases
extern volatile unsigned char           _PR8                 __at(0xF29);  // Note: Changed by MikroE
#ifndef _LIB_BUILD
asm("_PR8 equ 0F29h");  // Note: Changed by MikroE
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PR                     :8;
    };
    struct {
        unsigned T8PR                   :8;
    };
} T8PRbits_t;
extern volatile T8PRbits_t T8PRbits __at(0xF29);
// bitfield macros
#define _T8PR_PR_POSN                                       0x0
#define _T8PR_PR_POSITION                                   0x0
#define _T8PR_PR_SIZE                                       0x8
#define _T8PR_PR_LENGTH                                     0x8
#define _T8PR_PR_MASK                                       0xFF
#define _T8PR_T8PR_POSN                                     0x0
#define _T8PR_T8PR_POSITION                                 0x0
#define _T8PR_T8PR_SIZE                                     0x8
#define _T8PR_T8PR_LENGTH                                   0x8
#define _T8PR_T8PR_MASK                                     0xFF
// alias bitfield definitions
typedef union {
    struct {
        unsigned PR                     :8;
    };
    struct {
        unsigned T8PR                   :8;
    };
} PR8bits_t;
extern volatile PR8bits_t PR8bits __at(0xF29);
// bitfield macros
#define _PR8_PR_POSN                                        0x0
#define _PR8_PR_POSITION                                    0x0
#define _PR8_PR_SIZE                                        0x8
#define _PR8_PR_LENGTH                                      0x8
#define _PR8_PR_MASK                                        0xFF
#define _PR8_T8PR_POSN                                      0x0
#define _PR8_T8PR_POSITION                                  0x0
#define _PR8_T8PR_SIZE                                      0x8
#define _PR8_T8PR_LENGTH                                    0x8
#define _PR8_T8PR_MASK                                      0xFF

// Register: T8CON
#define T8CON T8CON
extern volatile unsigned char           T8CON               __at(0xF2A);
#ifndef _LIB_BUILD
asm("T8CON equ 0F2Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned OUTPS                  :4;
        unsigned CKPS                   :3;
        unsigned ON                     :1;
    };
    struct {
        unsigned OUTPS0                 :1;
        unsigned OUTPS1                 :1;
        unsigned OUTPS2                 :1;
        unsigned OUTPS3                 :1;
        unsigned CKPS0                  :1;
        unsigned CKPS1                  :1;
        unsigned CKPS2                  :1;
    };
    struct {
        unsigned T8OUTPS                :4;
        unsigned T8CKPS                 :3;
        unsigned T8ON                   :1;
    };
    struct {
        unsigned T8OUTPS0               :1;
        unsigned T8OUTPS1               :1;
        unsigned T8OUTPS2               :1;
        unsigned T8OUTPS3               :1;
        unsigned T8CKPS0                :1;
        unsigned T8CKPS1                :1;
        unsigned T8CKPS2                :1;
        unsigned TMR8ON                 :1;
    };
} T8CONbits_t;
