MikroElektronika/core_packages/PIC/XC8/def/PIC18LF65K40/mcu.h
extern volatile TMR7GATEbits_t TMR7GATEbits __at(0xF32);
// bitfield macros
#define _TMR7GATE_GSS_POSN                                  0x0
#define _TMR7GATE_GSS_POSITION                              0x0
#define _TMR7GATE_GSS_SIZE                                  0x5
#define _TMR7GATE_GSS_LENGTH                                0x5
#define _TMR7GATE_GSS_MASK                                  0x1F
#define _TMR7GATE_GSS0_POSN                                 0x0
#define _TMR7GATE_GSS0_POSITION                             0x0
#define _TMR7GATE_GSS0_SIZE                                 0x1
#define _TMR7GATE_GSS0_LENGTH                               0x1
#define _TMR7GATE_GSS0_MASK                                 0x1
#define _TMR7GATE_GSS1_POSN                                 0x1
#define _TMR7GATE_GSS1_POSITION                             0x1
#define _TMR7GATE_GSS1_SIZE                                 0x1
#define _TMR7GATE_GSS1_LENGTH                               0x1
#define _TMR7GATE_GSS1_MASK                                 0x2
#define _TMR7GATE_GSS2_POSN                                 0x2
#define _TMR7GATE_GSS2_POSITION                             0x2
#define _TMR7GATE_GSS2_SIZE                                 0x1
#define _TMR7GATE_GSS2_LENGTH                               0x1
#define _TMR7GATE_GSS2_MASK                                 0x4
#define _TMR7GATE_GSS3_POSN                                 0x3
#define _TMR7GATE_GSS3_POSITION                             0x3
#define _TMR7GATE_GSS3_SIZE                                 0x1
#define _TMR7GATE_GSS3_LENGTH                               0x1
#define _TMR7GATE_GSS3_MASK                                 0x8
#define _TMR7GATE_GSS4_POSN                                 0x4
#define _TMR7GATE_GSS4_POSITION                             0x4
#define _TMR7GATE_GSS4_SIZE                                 0x1
#define _TMR7GATE_GSS4_LENGTH                               0x1
#define _TMR7GATE_GSS4_MASK                                 0x10
#define _TMR7GATE_T7GSS0_POSN                               0x0
#define _TMR7GATE_T7GSS0_POSITION                           0x0
#define _TMR7GATE_T7GSS0_SIZE                               0x1
#define _TMR7GATE_T7GSS0_LENGTH                             0x1
#define _TMR7GATE_T7GSS0_MASK                               0x1
#define _TMR7GATE_T7GSS1_POSN                               0x1
#define _TMR7GATE_T7GSS1_POSITION                           0x1
#define _TMR7GATE_T7GSS1_SIZE                               0x1
#define _TMR7GATE_T7GSS1_LENGTH                             0x1
#define _TMR7GATE_T7GSS1_MASK                               0x2
#define _TMR7GATE_T7GSS2_POSN                               0x2
#define _TMR7GATE_T7GSS2_POSITION                           0x2
#define _TMR7GATE_T7GSS2_SIZE                               0x1
#define _TMR7GATE_T7GSS2_LENGTH                             0x1
#define _TMR7GATE_T7GSS2_MASK                               0x4
#define _TMR7GATE_T7GSS3_POSN                               0x3
#define _TMR7GATE_T7GSS3_POSITION                           0x3
#define _TMR7GATE_T7GSS3_SIZE                               0x1
#define _TMR7GATE_T7GSS3_LENGTH                             0x1
#define _TMR7GATE_T7GSS3_MASK                               0x8
#define _TMR7GATE_T7GSS4_POSN                               0x4
#define _TMR7GATE_T7GSS4_POSITION                           0x4
#define _TMR7GATE_T7GSS4_SIZE                               0x1
#define _TMR7GATE_T7GSS4_LENGTH                             0x1
#define _TMR7GATE_T7GSS4_MASK                               0x10

// Register: T7CLK
#define T7CLK T7CLK
extern volatile unsigned char           T7CLK               __at(0xF33);
#ifndef _LIB_BUILD
asm("T7CLK equ 0F33h");
#endif
// aliases
extern volatile unsigned char           TMR7CLK             __at(0xF33);
#ifndef _LIB_BUILD
asm("TMR7CLK equ 0F33h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CS                     :4;
    };
    struct {
        unsigned T7CS0                  :1;
        unsigned T7CS1                  :1;
        unsigned T7CS2                  :1;
        unsigned T7CS3                  :1;
    };
    struct {
        unsigned CS0                    :1;
        unsigned CS1                    :1;
        unsigned CS2                    :1;
        unsigned CS3                    :1;
    };
} T7CLKbits_t;
extern volatile T7CLKbits_t T7CLKbits __at(0xF33);
// bitfield macros
#define _T7CLK_CS_POSN                                      0x0
#define _T7CLK_CS_POSITION                                  0x0
#define _T7CLK_CS_SIZE                                      0x4
#define _T7CLK_CS_LENGTH                                    0x4
#define _T7CLK_CS_MASK                                      0xF
#define _T7CLK_T7CS0_POSN                                   0x0
#define _T7CLK_T7CS0_POSITION                               0x0
#define _T7CLK_T7CS0_SIZE                                   0x1
#define _T7CLK_T7CS0_LENGTH                                 0x1
#define _T7CLK_T7CS0_MASK                                   0x1
#define _T7CLK_T7CS1_POSN                                   0x1
#define _T7CLK_T7CS1_POSITION                               0x1
#define _T7CLK_T7CS1_SIZE                                   0x1
#define _T7CLK_T7CS1_LENGTH                                 0x1
#define _T7CLK_T7CS1_MASK                                   0x2
#define _T7CLK_T7CS2_POSN                                   0x2
#define _T7CLK_T7CS2_POSITION                               0x2
#define _T7CLK_T7CS2_SIZE                                   0x1
#define _T7CLK_T7CS2_LENGTH                                 0x1
#define _T7CLK_T7CS2_MASK                                   0x4
#define _T7CLK_T7CS3_POSN                                   0x3
#define _T7CLK_T7CS3_POSITION                               0x3
#define _T7CLK_T7CS3_SIZE                                   0x1
#define _T7CLK_T7CS3_LENGTH                                 0x1
#define _T7CLK_T7CS3_MASK                                   0x8
#define _T7CLK_CS0_POSN                                     0x0
#define _T7CLK_CS0_POSITION                                 0x0
#define _T7CLK_CS0_SIZE                                     0x1
#define _T7CLK_CS0_LENGTH                                   0x1
#define _T7CLK_CS0_MASK                                     0x1
#define _T7CLK_CS1_POSN                                     0x1
#define _T7CLK_CS1_POSITION                                 0x1
#define _T7CLK_CS1_SIZE                                     0x1
#define _T7CLK_CS1_LENGTH                                   0x1
#define _T7CLK_CS1_MASK                                     0x2
#define _T7CLK_CS2_POSN                                     0x2
#define _T7CLK_CS2_POSITION                                 0x2
#define _T7CLK_CS2_SIZE                                     0x1
#define _T7CLK_CS2_LENGTH                                   0x1
#define _T7CLK_CS2_MASK                                     0x4
#define _T7CLK_CS3_POSN                                     0x3
#define _T7CLK_CS3_POSITION                                 0x3
#define _T7CLK_CS3_SIZE                                     0x1
#define _T7CLK_CS3_LENGTH                                   0x1
#define _T7CLK_CS3_MASK                                     0x8
// alias bitfield definitions
typedef union {
    struct {
        unsigned CS                     :4;
    };
    struct {
        unsigned T7CS0                  :1;
        unsigned T7CS1                  :1;
        unsigned T7CS2                  :1;
        unsigned T7CS3                  :1;
    };
    struct {
        unsigned CS0                    :1;
        unsigned CS1                    :1;
        unsigned CS2                    :1;
        unsigned CS3                    :1;
    };
} TMR7CLKbits_t;
extern volatile TMR7CLKbits_t TMR7CLKbits __at(0xF33);
// bitfield macros
#define _TMR7CLK_CS_POSN                                    0x0
#define _TMR7CLK_CS_POSITION                                0x0
#define _TMR7CLK_CS_SIZE                                    0x4
#define _TMR7CLK_CS_LENGTH                                  0x4
#define _TMR7CLK_CS_MASK                                    0xF
#define _TMR7CLK_T7CS0_POSN                                 0x0
#define _TMR7CLK_T7CS0_POSITION                             0x0
#define _TMR7CLK_T7CS0_SIZE                                 0x1
#define _TMR7CLK_T7CS0_LENGTH                               0x1
#define _TMR7CLK_T7CS0_MASK                                 0x1
#define _TMR7CLK_T7CS1_POSN                                 0x1
#define _TMR7CLK_T7CS1_POSITION                             0x1
#define _TMR7CLK_T7CS1_SIZE                                 0x1
#define _TMR7CLK_T7CS1_LENGTH                               0x1
#define _TMR7CLK_T7CS1_MASK                                 0x2
#define _TMR7CLK_T7CS2_POSN                                 0x2
#define _TMR7CLK_T7CS2_POSITION                             0x2
#define _TMR7CLK_T7CS2_SIZE                                 0x1
#define _TMR7CLK_T7CS2_LENGTH                               0x1
#define _TMR7CLK_T7CS2_MASK                                 0x4
#define _TMR7CLK_T7CS3_POSN                                 0x3
#define _TMR7CLK_T7CS3_POSITION                             0x3
#define _TMR7CLK_T7CS3_SIZE                                 0x1
#define _TMR7CLK_T7CS3_LENGTH                               0x1
#define _TMR7CLK_T7CS3_MASK                                 0x8
#define _TMR7CLK_CS0_POSN                                   0x0
#define _TMR7CLK_CS0_POSITION                               0x0
#define _TMR7CLK_CS0_SIZE                                   0x1
#define _TMR7CLK_CS0_LENGTH                                 0x1
#define _TMR7CLK_CS0_MASK                                   0x1
#define _TMR7CLK_CS1_POSN                                   0x1
#define _TMR7CLK_CS1_POSITION                               0x1
#define _TMR7CLK_CS1_SIZE                                   0x1
#define _TMR7CLK_CS1_LENGTH                                 0x1
#define _TMR7CLK_CS1_MASK                                   0x2
#define _TMR7CLK_CS2_POSN                                   0x2
#define _TMR7CLK_CS2_POSITION                               0x2
#define _TMR7CLK_CS2_SIZE                                   0x1
#define _TMR7CLK_CS2_LENGTH                                 0x1
#define _TMR7CLK_CS2_MASK                                   0x4
#define _TMR7CLK_CS3_POSN                                   0x3
#define _TMR7CLK_CS3_POSITION                               0x3
#define _TMR7CLK_CS3_SIZE                                   0x1
#define _TMR7CLK_CS3_LENGTH                                 0x1
#define _TMR7CLK_CS3_MASK                                   0x8

