MikroElektronika/core_packages/PIC/XC8/def/PIC18LF65K40/mcu.h
extern volatile BAUD1CONbits_t BAUD1CONbits __at(0xF9E);
// bitfield macros
#define _BAUD1CON_ABDEN_POSN                                0x0
#define _BAUD1CON_ABDEN_POSITION                            0x0
#define _BAUD1CON_ABDEN_SIZE                                0x1
#define _BAUD1CON_ABDEN_LENGTH                              0x1
#define _BAUD1CON_ABDEN_MASK                                0x1
#define _BAUD1CON_WUE_POSN                                  0x1
#define _BAUD1CON_WUE_POSITION                              0x1
#define _BAUD1CON_WUE_SIZE                                  0x1
#define _BAUD1CON_WUE_LENGTH                                0x1
#define _BAUD1CON_WUE_MASK                                  0x2
#define _BAUD1CON_BRG16_POSN                                0x3
#define _BAUD1CON_BRG16_POSITION                            0x3
#define _BAUD1CON_BRG16_SIZE                                0x1
#define _BAUD1CON_BRG16_LENGTH                              0x1
#define _BAUD1CON_BRG16_MASK                                0x8
#define _BAUD1CON_SCKP_POSN                                 0x4
#define _BAUD1CON_SCKP_POSITION                             0x4
#define _BAUD1CON_SCKP_SIZE                                 0x1
#define _BAUD1CON_SCKP_LENGTH                               0x1
#define _BAUD1CON_SCKP_MASK                                 0x10
#define _BAUD1CON_RCIDL_POSN                                0x6
#define _BAUD1CON_RCIDL_POSITION                            0x6
#define _BAUD1CON_RCIDL_SIZE                                0x1
#define _BAUD1CON_RCIDL_LENGTH                              0x1
#define _BAUD1CON_RCIDL_MASK                                0x40
#define _BAUD1CON_ABDOVF_POSN                               0x7
#define _BAUD1CON_ABDOVF_POSITION                           0x7
#define _BAUD1CON_ABDOVF_SIZE                               0x1
#define _BAUD1CON_ABDOVF_LENGTH                             0x1
#define _BAUD1CON_ABDOVF_MASK                               0x80
#define _BAUD1CON_ABDEN1_POSN                               0x0
#define _BAUD1CON_ABDEN1_POSITION                           0x0
#define _BAUD1CON_ABDEN1_SIZE                               0x1
#define _BAUD1CON_ABDEN1_LENGTH                             0x1
#define _BAUD1CON_ABDEN1_MASK                               0x1
#define _BAUD1CON_ABDOVF1_POSN                              0x7
#define _BAUD1CON_ABDOVF1_POSITION                          0x7
#define _BAUD1CON_ABDOVF1_SIZE                              0x1
#define _BAUD1CON_ABDOVF1_LENGTH                            0x1
#define _BAUD1CON_ABDOVF1_MASK                              0x80
#define _BAUD1CON_BRG161_POSN                               0x3
#define _BAUD1CON_BRG161_POSITION                           0x3
#define _BAUD1CON_BRG161_SIZE                               0x1
#define _BAUD1CON_BRG161_LENGTH                             0x1
#define _BAUD1CON_BRG161_MASK                               0x8
#define _BAUD1CON_CKTXP_POSN                                0x4
#define _BAUD1CON_CKTXP_POSITION                            0x4
#define _BAUD1CON_CKTXP_SIZE                                0x1
#define _BAUD1CON_CKTXP_LENGTH                              0x1
#define _BAUD1CON_CKTXP_MASK                                0x10
#define _BAUD1CON_RCIDL1_POSN                               0x6
#define _BAUD1CON_RCIDL1_POSITION                           0x6
#define _BAUD1CON_RCIDL1_SIZE                               0x1
#define _BAUD1CON_RCIDL1_LENGTH                             0x1
#define _BAUD1CON_RCIDL1_MASK                               0x40
#define _BAUD1CON_RCMT_POSN                                 0x6
#define _BAUD1CON_RCMT_POSITION                             0x6
#define _BAUD1CON_RCMT_SIZE                                 0x1
#define _BAUD1CON_RCMT_LENGTH                               0x1
#define _BAUD1CON_RCMT_MASK                                 0x40
#define _BAUD1CON_RCMT1_POSN                                0x6
#define _BAUD1CON_RCMT1_POSITION                            0x6
#define _BAUD1CON_RCMT1_SIZE                                0x1
#define _BAUD1CON_RCMT1_LENGTH                              0x1
#define _BAUD1CON_RCMT1_MASK                                0x40
#define _BAUD1CON_SCKP1_POSN                                0x4
#define _BAUD1CON_SCKP1_POSITION                            0x4
#define _BAUD1CON_SCKP1_SIZE                                0x1
#define _BAUD1CON_SCKP1_LENGTH                              0x1
#define _BAUD1CON_SCKP1_MASK                                0x10
#define _BAUD1CON_TXCKP_POSN                                0x4
#define _BAUD1CON_TXCKP_POSITION                            0x4
#define _BAUD1CON_TXCKP_SIZE                                0x1
#define _BAUD1CON_TXCKP_LENGTH                              0x1
#define _BAUD1CON_TXCKP_MASK                                0x10
#define _BAUD1CON_TXCKP1_POSN                               0x4
#define _BAUD1CON_TXCKP1_POSITION                           0x4
#define _BAUD1CON_TXCKP1_SIZE                               0x1
#define _BAUD1CON_TXCKP1_LENGTH                             0x1
#define _BAUD1CON_TXCKP1_MASK                               0x10
#define _BAUD1CON_WUE1_POSN                                 0x1
#define _BAUD1CON_WUE1_POSITION                             0x1
#define _BAUD1CON_WUE1_SIZE                                 0x1
#define _BAUD1CON_WUE1_LENGTH                               0x1
#define _BAUD1CON_WUE1_MASK                                 0x2
#define _BAUD1CON_W4E_POSN                                  0x1
#define _BAUD1CON_W4E_POSITION                              0x1
#define _BAUD1CON_W4E_SIZE                                  0x1
#define _BAUD1CON_W4E_LENGTH                                0x1
#define _BAUD1CON_W4E_MASK                                  0x2
// alias bitfield definitions
typedef union {
    struct {
        unsigned ABDEN                  :1;
        unsigned WUE                    :1;
        unsigned                        :1;
        unsigned BRG16                  :1;
        unsigned SCKP                   :1;
        unsigned                        :1;
        unsigned RCIDL                  :1;
        unsigned ABDOVF                 :1;
    };
    struct {
        unsigned ABDEN1                 :1;
    };
    struct {
        unsigned                        :7;
        unsigned ABDOVF1                :1;
    };
    struct {
        unsigned                        :3;
        unsigned BRG161                 :1;
    };
    struct {
        unsigned                        :4;
        unsigned CKTXP                  :1;
    };
    struct {
        unsigned                        :6;
        unsigned RCIDL1                 :1;
    };
    struct {
        unsigned                        :6;
        unsigned RCMT                   :1;
    };
    struct {
        unsigned                        :6;
        unsigned RCMT1                  :1;
    };
    struct {
        unsigned                        :4;
        unsigned SCKP1                  :1;
    };
    struct {
        unsigned                        :4;
        unsigned TXCKP                  :1;
    };
    struct {
        unsigned                        :4;
        unsigned TXCKP1                 :1;
    };
    struct {
        unsigned                        :1;
        unsigned WUE1                   :1;
    };
    struct {
        unsigned                        :1;
        unsigned W4E                    :1;
    };
} BAUDCON1bits_t;
extern volatile BAUDCON1bits_t BAUDCON1bits __at(0xF9E);
// bitfield macros
#define _BAUDCON1_ABDEN_POSN                                0x0
#define _BAUDCON1_ABDEN_POSITION                            0x0
#define _BAUDCON1_ABDEN_SIZE                                0x1
#define _BAUDCON1_ABDEN_LENGTH                              0x1
#define _BAUDCON1_ABDEN_MASK                                0x1
#define _BAUDCON1_WUE_POSN                                  0x1
#define _BAUDCON1_WUE_POSITION                              0x1
#define _BAUDCON1_WUE_SIZE                                  0x1
#define _BAUDCON1_WUE_LENGTH                                0x1
#define _BAUDCON1_WUE_MASK                                  0x2
#define _BAUDCON1_BRG16_POSN                                0x3
#define _BAUDCON1_BRG16_POSITION                            0x3
#define _BAUDCON1_BRG16_SIZE                                0x1
#define _BAUDCON1_BRG16_LENGTH                              0x1
#define _BAUDCON1_BRG16_MASK                                0x8
#define _BAUDCON1_SCKP_POSN                                 0x4
#define _BAUDCON1_SCKP_POSITION                             0x4
#define _BAUDCON1_SCKP_SIZE                                 0x1
#define _BAUDCON1_SCKP_LENGTH                               0x1
#define _BAUDCON1_SCKP_MASK                                 0x10
#define _BAUDCON1_RCIDL_POSN                                0x6
#define _BAUDCON1_RCIDL_POSITION                            0x6
#define _BAUDCON1_RCIDL_SIZE                                0x1
#define _BAUDCON1_RCIDL_LENGTH                              0x1
#define _BAUDCON1_RCIDL_MASK                                0x40
#define _BAUDCON1_ABDOVF_POSN                               0x7
#define _BAUDCON1_ABDOVF_POSITION                           0x7
#define _BAUDCON1_ABDOVF_SIZE                               0x1
#define _BAUDCON1_ABDOVF_LENGTH                             0x1
#define _BAUDCON1_ABDOVF_MASK                               0x80
#define _BAUDCON1_ABDEN1_POSN                               0x0
#define _BAUDCON1_ABDEN1_POSITION                           0x0
#define _BAUDCON1_ABDEN1_SIZE                               0x1
#define _BAUDCON1_ABDEN1_LENGTH                             0x1
#define _BAUDCON1_ABDEN1_MASK                               0x1
#define _BAUDCON1_ABDOVF1_POSN                              0x7
#define _BAUDCON1_ABDOVF1_POSITION                          0x7
#define _BAUDCON1_ABDOVF1_SIZE                              0x1
#define _BAUDCON1_ABDOVF1_LENGTH                            0x1
#define _BAUDCON1_ABDOVF1_MASK                              0x80
#define _BAUDCON1_BRG161_POSN                               0x3
#define _BAUDCON1_BRG161_POSITION                           0x3
#define _BAUDCON1_BRG161_SIZE                               0x1
#define _BAUDCON1_BRG161_LENGTH                             0x1
#define _BAUDCON1_BRG161_MASK                               0x8
#define _BAUDCON1_CKTXP_POSN                                0x4
#define _BAUDCON1_CKTXP_POSITION                            0x4
#define _BAUDCON1_CKTXP_SIZE                                0x1
#define _BAUDCON1_CKTXP_LENGTH                              0x1
#define _BAUDCON1_CKTXP_MASK                                0x10
#define _BAUDCON1_RCIDL1_POSN                               0x6
#define _BAUDCON1_RCIDL1_POSITION                           0x6
#define _BAUDCON1_RCIDL1_SIZE                               0x1
#define _BAUDCON1_RCIDL1_LENGTH                             0x1
#define _BAUDCON1_RCIDL1_MASK                               0x40
#define _BAUDCON1_RCMT_POSN                                 0x6
#define _BAUDCON1_RCMT_POSITION                             0x6
#define _BAUDCON1_RCMT_SIZE                                 0x1
#define _BAUDCON1_RCMT_LENGTH                               0x1
#define _BAUDCON1_RCMT_MASK                                 0x40
#define _BAUDCON1_RCMT1_POSN                                0x6
#define _BAUDCON1_RCMT1_POSITION                            0x6
#define _BAUDCON1_RCMT1_SIZE                                0x1
#define _BAUDCON1_RCMT1_LENGTH                              0x1
#define _BAUDCON1_RCMT1_MASK                                0x40
#define _BAUDCON1_SCKP1_POSN                                0x4
#define _BAUDCON1_SCKP1_POSITION                            0x4
#define _BAUDCON1_SCKP1_SIZE                                0x1
#define _BAUDCON1_SCKP1_LENGTH                              0x1
#define _BAUDCON1_SCKP1_MASK                                0x10
#define _BAUDCON1_TXCKP_POSN                                0x4
#define _BAUDCON1_TXCKP_POSITION                            0x4
#define _BAUDCON1_TXCKP_SIZE                                0x1
#define _BAUDCON1_TXCKP_LENGTH                              0x1
#define _BAUDCON1_TXCKP_MASK                                0x10
#define _BAUDCON1_TXCKP1_POSN                               0x4
#define _BAUDCON1_TXCKP1_POSITION                           0x4
#define _BAUDCON1_TXCKP1_SIZE                               0x1
#define _BAUDCON1_TXCKP1_LENGTH                             0x1
#define _BAUDCON1_TXCKP1_MASK                               0x10
#define _BAUDCON1_WUE1_POSN                                 0x1
#define _BAUDCON1_WUE1_POSITION                             0x1
#define _BAUDCON1_WUE1_SIZE                                 0x1
#define _BAUDCON1_WUE1_LENGTH                               0x1
#define _BAUDCON1_WUE1_MASK                                 0x2
#define _BAUDCON1_W4E_POSN                                  0x1
#define _BAUDCON1_W4E_POSITION                              0x1
#define _BAUDCON1_W4E_SIZE                                  0x1
#define _BAUDCON1_W4E_LENGTH                                0x1
#define _BAUDCON1_W4E_MASK                                  0x2
typedef union {
    struct {
        unsigned ABDEN                  :1;
        unsigned WUE                    :1;
        unsigned                        :1;
        unsigned BRG16                  :1;
        unsigned SCKP                   :1;
        unsigned                        :1;
        unsigned RCIDL                  :1;
        unsigned ABDOVF                 :1;
    };
    struct {
        unsigned ABDEN1                 :1;
    };
    struct {
        unsigned                        :7;
        unsigned ABDOVF1                :1;
    };
    struct {
        unsigned                        :3;
        unsigned BRG161                 :1;
    };
    struct {
        unsigned                        :4;
        unsigned CKTXP                  :1;
    };
    struct {
        unsigned                        :6;
        unsigned RCIDL1                 :1;
    };
    struct {
        unsigned                        :6;
        unsigned RCMT                   :1;
    };
    struct {
        unsigned                        :6;
        unsigned RCMT1                  :1;
    };
    struct {
        unsigned                        :4;
        unsigned SCKP1                  :1;
    };
    struct {
        unsigned                        :4;
        unsigned TXCKP                  :1;
    };
    struct {
        unsigned                        :4;
        unsigned TXCKP1                 :1;
    };
    struct {
        unsigned                        :1;
        unsigned WUE1                   :1;
    };
    struct {
        unsigned                        :1;
        unsigned W4E                    :1;
    };
} BAUDCTL1bits_t;
